# Brewfile - Dotfiles 2.0
# Install with: brew bundle --file=Brewfile

# -----------------------------------------------------------------------------
# Taps
# -----------------------------------------------------------------------------
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# -----------------------------------------------------------------------------
# CLI Tools
# -----------------------------------------------------------------------------
brew "chezmoi"          # Dotfiles manager
brew "git"              # Version control
brew "neovim"           # Editor
brew "tmux"             # Terminal multiplexer
brew "tpm"              # Tmux Plugin Manager
brew "zsh"              # Shell
brew "telnet"           # Telnet client
brew "alacritty"        # Terminal emulator
brew "bat"             # Better cat

# random fun shit
brew "lolcat"           # Rainbow coloring for terminal output
brew "figlet"           # ASCII art text generator

# -----------------------------------------------------------------------------
# Network Engineering & Security Tools
# -----------------------------------------------------------------------------

# Network scanning & discovery
brew "nmap"              # Network mapper and port scanner
brew "masscan"           # Fast port scanner
brew "arp-scan"          # ARP scanning and fingerprinting

# Packet capture & analysis
brew "wireshark"         # Network protocol analyzer (CLI + GUI)
brew "tcpdump"           # Packet analyzer
brew "tshark"            # Terminal-based Wireshark

# Network diagnostics & testing
brew "mtr"               # Network diagnostic tool (traceroute + ping)
brew "iperf3"            # Network bandwidth testing
brew "netcat"            # Networking utility for reading/writing network connections
brew "socat"             # Multipurpose relay (SOcket CAT)
brew "speedtest-cli"     # Command line internet speed test
brew "ipcalc"            # IP subnet calculator
brew "snitch"            # Network monitor for macOS 

# DNS tools
brew "bind"              # DNS tools (dig, nslookup, host)
brew "dog"               # Modern DNS client (dig replacement)
brew "dnsmasq"           # Lightweight DNS forwarder

# HTTP/API testing
brew "httpie"            # User-friendly HTTP client
brew "hey"               # HTTP load generator
brew "wrk"               # Modern HTTP benchmarking tool

# Network monitoring
brew "iftop"             # Display bandwidth usage per interface
brew "bandwhich"         # Terminal bandwidth utilization tool (per process)
brew "bmon"              # Bandwidth monitor and rate estimator

# Security testing & penetration testing
brew "hydra"             # Network logon cracker
brew "hashcat"           # Advanced password recovery
brew "john-jumbo"        # John the Ripper password cracker
brew "sqlmap"            # Automatic SQL injection tool
brew "nikto"             # Web server scanner
brew "aircrack-ng"       # WiFi security auditing tools suite

# VPN & tunneling
brew "openvpn"           # SSL/TLS VPN
brew "wireguard-tools"   # Fast, modern VPN tools
brew "ngrok"             # Secure tunneling to localhost

# TLS/SSL tools
brew "openssl@3"         # Cryptography and SSL/TLS toolkit
brew "mkcert"            # Make locally trusted development certificates
brew "certbot"           # Let's Encrypt certificate automation

# Protocol analysis & API tools
brew "grpcurl"           # cURL for gRPC services
brew "protobuf"          # Protocol buffers

# Cloud & Infrastructure
brew "awscli"            # AWS command line interface
brew "terraform"         # Infrastructure as Code tool

# Modern CLI replacements
brew "bat"              # Better cat
brew "eza"              # Better ls (formerly exa)
brew "fd"               # Better find
brew "fzf"              # Fuzzy finder
brew "ripgrep"          # Better grep
brew "zoxide"           # Better cd
brew "delta"            # Better git diff

# Development tools
brew "gh"               # GitHub CLI
brew "jq"               # JSON processor
brew "lazygit"          # Git TUI
brew "starship"         # Cross-shell prompt
brew "tree"             # Directory tree
brew "wget"             # HTTP client
brew "curl"             # HTTP client
brew "grex"             # Regex generator
brew "claude"       # Claude AI CLI

# Node.js (for NVChad LSP, etc.)
brew "node"
brew "npm"

# Python
brew "python@3.12"

# Shell enhancements
#brew "zsh-autosuggestions"
#brew "zsh-syntax-highlighting"


# -----------------------------------------------------------------------------
# Applications (Casks)
# -----------------------------------------------------------------------------
cask "claude-code"
cask "bartender"
#cask "domzilla-caffeine" # Need to look into this
cask "firefox"
cask "discord"
cask "tailscale"
#cask "iterm2"           # Terminal emulator
#cask "raycast"          # Spotlight replacement
cask "visual-studio-code"
#cask "docker"
#cask "rectangle"        # Window management
cask "1password"        # Password manager
#cask "notion"           # Notes
#cask "slack"            # Communication
#cask "spotify"          # Music
#cask "arc"              # Browser

# -----------------------------------------------------------------------------
# Fonts
# -----------------------------------------------------------------------------
cask "font-meslo-lg-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"

# -----------------------------------------------------------------------------
# Mac App Store Apps (requires: brew install mas)
# -----------------------------------------------------------------------------
brew "mas"
# AppleStore not working in my VM for testing
#mas "Xcode", id: 497799835
#mas "Amphetamine", id: 937984704
#mas "Parcel", id: 375589283
#mas "Windows App", id: 1295203466
#mas "1Password for Safari", id: 1569813296
